app/views/projects/show.html.erb

SELECT "tasks".* FROM "tasks" WHERE "tasks"."project_id" = $1  [["project_id", 2]]
---
			<h4>Completed Tasks</h4>
				<% @project.tasks.each do |task| %>

SELECT "tags".* FROM "tags" INNER JOIN "taggings" ON "tags"."id" = "taggings"."tag_id" WHERE "taggings"."project_id" = $1  [["project_id", 15]]
---
	<!-- add tags here -->
	<p>Tags: <%= raw @project.tags.map(&:name).map { |tag| link_to tag, "#" }.join(', ') %></p>

SELECT "discussions".* FROM "discussions" WHERE "discussions"."project_id" = $1  [["project_id", 2]]
---
	<h1>Current Discussions</h1>
	<% @project.discussions.each do |discussion| %>

SELECT "comments".* FROM "comments" WHERE "comments"."discussion_id" = $1  [["discussion_id", 4]]
---

		 <% discussion.comments.each do |comment| %>