app/controllers/comments_controller.rb

	def create
		@discussion = Discussion.find params[:discussion_id]
		@comment = Comment.new comment_params

		@comment.discussion = @discussion

		#@comment.answer.user = current.user

		if @comment.save
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "comments" ("body", "discussion_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "hi"], ["discussion_id", 2], ["created_at", "2015-01-31 02:29:03.975805"], ["updated_at", "2015-01-31 02:29:03.975805"]]

	def edit
		@discussion = Discussion.find params[:discussion_id]
		@comment = Comment.find params[:id]
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT 1  [["id", 2]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 1]]

	def update
		@discussion = Discussion.find params[:discussion_id]
		@comment = Comment.find params[:id]

		if @comment.update comment_params
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT 1  [["id", 4]]
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 4]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "first comment updated"], ["updated_at", "2015-01-31 02:43:40.638789"], ["id", 4]]

	def destroy
		@comment = Comment.find params[:id]

		@comment.destroy
---
SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 2]]