app/controllers/discussions_controller.rb

	def create
		#render text: params
		@discussion = Discussion.new discussion_params


		@discussion.project = @project

		if @discussion.save
---
INSERT INTO "discussions" ("title", "description", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["title", "asdfasdfa"], ["description", "sdfasdfaj"], ["project_id", 2], ["created_at", "2015-01-31 01:18:52.237919"], ["updated_at", "2015-01-31 01:18:52.237919"]]

	def edit
		@discussion = Discussion.find params[:id]
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT 1  [["id", 2]]

	def update

		@discussion = Discussion.find params[:id]

		if @discussion.update discussion_params
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "discussions" SET "title" = $1, "updated_at" = $2 WHERE "discussions"."id" = $3  [["title", "edited title"], ["updated_at", "2015-01-31 02:07:55.465962"], ["id", 2]]

	def destroy
		#@discussion = current_user.answers.find params[:id]

		@discussion = Discussion.find params[:id]

		@discussion.destroy
---
SELECT  "discussions".* FROM "discussions" WHERE "discussions"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "discussions" WHERE "discussions"."id" = $1  [["id", 1]]

	def find_project
		@project = Project.find params[:project_id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 5]]