app/controllers/favorites_controller.rb

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 14]]
INSERT INTO "favorites" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 14], ["user_id", 18], ["created_at", "2015-02-07 08:38:11.996397"], ["updated_at", "2015-02-07 08:38:11.996397"]]
---
	def create
		@project = Project.find params[:project_id]
		@favorite = @project.favorites.new
		@favorite.user = current_user

		if @favorite.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 14]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."project_id" = $1 AND "favorites"."id" = $2 LIMIT 1  [["project_id", 14], ["id", 5]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 5]]
---
	def destroy
		@project = Project.find params[:project_id]
		@favorite = @project.favorites.find params[:id]

		if @favorite.destroy