app/controllers/projects_controller.rb

INSERT INTO "projects" ("title", "description", "due_date", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Maggie's Project 2"], ["description", "asdf"], ["due_date", "2015-02-07"], ["user_id", 18], ["created_at", "2015-02-07 09:16:34.242280"], ["updated_at", "2015-02-07 09:16:34.242280"]]
---
	def create
		@project = Project.new project_params
		@project.user = current_user


		if @project.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
---
	def edit
		@project = Project.find params[:id]

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
---
	def show
		@project = Project.find params[:id]

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "projects" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "projects"."id" = $4  [["title", "Blah"], ["description", "eefraksldjfasrf ewrwieorjqwef asodfijas;f"], ["updated_at", "2015-01-23 01:26:06.686228"], ["id", 1]]
---
	def update
		@project = Project.find params[:id]

		if @project.update project_params

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "projects" WHERE "projects"."id" = $1  [["id", 1]]
---
	def destroy
		@project = Project.find params[:id]

		@project.destroy