app/controllers/tags_controller.rb

	def create
		@project = Project.find params[:project_id]
		@tag = @project.tags.new tag_params

		if @tag.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 14]]
INSERT INTO "tags" ("name", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "sdfad"], ["project_id", 14], ["created_at", "2015-02-07 09:50:57.609936"], ["updated_at", "2015-02-07 09:50:57.609936"]]