app/controllers/tasks_controller.rb

	def new
		@project = Project.find params[:project_id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]

	def create
		@project = Project.find params[:project_id]
		@task = Task.new task_params

		@task.user = current_user


		@task.project = @project

		if @task.save
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
INSERT INTO "tasks" ("title", "body", "due_date", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "dsfasdf"], ["body", ""], ["due_date", "2015-02-04"], ["project_id", 2], ["created_at", "2015-02-05 03:49:17.631757"], ["updated_at", "2015-02-05 03:49:17.631757"]]

	def edit
		@project = Project.find params[:project_id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]

	def show
		@project = Project.find params[:project_id]
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]

	def update
		@project = Project.find params[:project_id]
		if @task.update task_params
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["title", "trying another task again"], ["body", "sdfasdfa"], ["updated_at", "2015-02-05 04:37:15.806290"], ["id", 59]]

	def mark_complete
		@project = Project.find params[:project_id]
		@task.update(completed_status: true)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "completed_status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed_status", "t"], ["updated_at", "2015-02-04 01:00:16.305377"], ["id", 46]]

	def mark_incomplete
		@project = Project.find params[:project_id]
		@task.update(completed_status: false)
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
UPDATE "tasks" SET "completed_status" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completed_status", "f"], ["updated_at", "2015-02-04 01:00:20.102595"], ["id", 46]]

	def destroy
		@project = Project.find params[:project_id]
		@task.destroy
---
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", 2]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 1]]

	def find_task
		@task = Task.find params[:id]
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT 1  [["id", 46]]